{
  "title": "Meet Our Team",
  "bannerText": "Our Team",
  "heading": {
    "meet": "Meet",
    "contact": "Contact",
    "education": "Education and Licenses",
    "language": "We speak your language"
  },
  "team": [
    {
      "name": "Raymond Luk",
      "position": "Lawyer",
      "description": "Raymond Luk is the founding lawyer of the law firm, bringing a wealth of knowledge, dedication, and a client-focused approach to the practice of law. A proud graduate of the University of Toronto, where he earned an Honours Bachelor of Arts with High Distinction, Raymond went on to attend Queen’s University, obtaining his Juris Doctor.<br/><br/>With extensive experience representing clients at the Superior Court of Ontario, the Licensed Appeal Tribunal, and the Human Rights Tribunal of Ontario, Raymond is a skilled advocate who is committed to achieving the best possible outcomes for his clients. He practices in the areas of Family Law, Wills and Estates, Personal Injury, Real Estate, and Corporate Law, providing comprehensive legal solutions tailored to each client’s unique needs.<br/><br/>In addition to his legal practice, Raymond is a frequent contributor to Ming Pao Daily News, the leading Chinese-language newspaper in Canada. He has also made multiple appearances on OMNI News, a local and national newscast available in various languages on the Omni Television system in Canada. Through these platforms, Raymond shares valuable legal insights and helps educate the community on important legal issues.<br/><br/>Raymond is dedicated to building a practice rooted in integrity, professionalism, and a deep understanding of the law. He takes pride in offering personalized attention and clear, practical advice to help clients navigate complex legal matters with confidence.<br/><br/>Raymond is fluent in Cantonese and English, and he understands Mandarin.",
      "image": "/assets/team/raymond-luk.jpg",
      "education": [
        "B.A. (Hons.) University of Toronto",
        "J.D. Queen's University",
        "Barrister and Solicitor",
        "Notary Public"
      ],
      "phone": [
        { "number": "905-333-1740", "description": "Ext.168 (Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "rluk@luklawpc.com"
    },
    {
      "name": "Eiman Sharifpour",
      "position": "Lawyer",
      "description": "Eiman Sharifpour is a dedicated and compassionate family law attorney who brings a client-focused approach to every case. With a deep understanding of the emotional and legal complexities surrounding family law matters, Eiman is committed to providing personalized and effective solutions for his clients.<br/><br/>Eiman’s practice encompasses a wide range of family law issues, including divorce, child custody, spousal support, and property division. He is known for his ability to navigate challenging situations with empathy, strategic thinking, and a steadfast commitment to achieving the best possible outcomes for his clients.<br/><br/>A skilled negotiator and litigator, Eiman is equally adept at resolving cases through mediation and collaborative law as he is at advocating for his clients in the courtroom. His attention to detail, strong communication skills, and unwavering dedication have earned him the trust and respect of his clients and peers alike.<br/><br/>Outside of his legal practice, Eiman is a passionate sports enthusiast. He is an avid supporter of the Toronto Raptors and FC Barcelona, and he enjoys playing soccer in his free time. His love for teamwork and competition on the field translates into his approach to the law, where he strives to collaborate effectively and advocate fiercely for his clients.<br/><br/>Eiman earned his Juris Doctor from the University of Windsor and is a member of the Law Society of Ontario. Eiman works closely with Raymond and the rest of the team to ensure that every client receives the highest level of legal representation and support during some of life’s most difficult moments.",
      "image": "/assets/team/eiman-sharifpour.jpg",
      "education": [
        "B.Sc York University",
        "J.D. University of Windsor",
        "Barrister and Solicitor",
        "Notary Public"
      ],
      "phone": [
        { "number": "905-291-1802", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "esharifpour@luklawpc.com",
      "desc": "* Currently practicing through Iman Law Professional Corporation"
    },
    {
      "name": "Raymond Lee",
      "position": "Senior Licensed Paralegal",
      "description": "Raymond Lee is a skilled and dedicated paralegal who brings precision and professionalism to his practice. Licensed by the Law Society of Ontario, Raymond acts primarily in Landlord and Tenant Board disputes, Small Claims Court matters, and provincial offence/ticketing files, providing clients with clear guidance and assertive representation.<br/><br/>Raymond holds a Bachelor of Commerce from the University of Toronto, an Advanced Diploma in Legal Studies (Common Law) from the University of Hong Kong, and is a Fellow of the Institute of Paralegals in the United Kingdom. This diverse academic background equips him with both legal and business insight, enhancing his ability to address complex legal matters with analytical depth and practical judgment.<br/><br/>With a thorough understanding of procedural law and a client-focused approach, Raymond assists tenants, landlords, and individuals navigating legal challenges—from lease disputes and eviction proceedings to debt recovery and traffic violations. His ability to simplify complex processes empowers clients to make informed decisions about their cases.<br/><br/>Fluent in English, Cantonese, and Mandarin, Raymond ensures effective communication with clients from diverse backgrounds, fostering trust and clarity throughout the legal process. His cultural competency and attention to detail enable him to deliver tailored solutions for each client’s unique needs.<br/><br/>Committed to accessibility and efficiency, Raymond combines rigorous legal analysis with practical strategies to achieve resolutions. Whether negotiating settlements or advocating in courts and tribunals, he prioritizes his clients’ best interests with integrity and professionalism.<br/><br/>Outside the office, Raymond enjoys swimming, cycling, and cheering on Liverpool FC. He also loves traveling with his family, exploring new destinations whenever possible.",
      "image": "/assets/team/raymond-lee.jpg",
      "education": [
        "BCom University of Toronto",
        "Advanced Diploma in Legal Studies (Common Law), University of Hong Kong",
        "Licensed Paralegal (Law Society of Ontario)",
        "Fellow, Institute of Paralegals (United Kingdom)"
      ],
      "phone": [
        { "number": "905-333-1740", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "rlee@luklawpc.com"
    },
    {
      "name": "Christine Guan",
      "position": "Real Estate Law Clerk & Licensed Paralegal",
      "description": "Christine Guan is a highly skilled and detail-oriented Real Estate Law Clerk and Licensed Paralegal with over 10 years of experience in the legal field. Originally specializing in tort and accident benefits law as a paralegal, Christine has since transitioned into real estate law, where she brings her exceptional organizational skills, legal knowledge, and client-focused approach to every transaction.<br/><br/>Christine’s expertise covers a wide range of real estate services, including residential and commercial transactions, title searches, drafting legal documents, and coordinating closings. Her meticulous attention to detail, proactive mindset, and ability to manage complex processes make her an invaluable asset to clients and the legal team alike.<br/><br/>Fluent in English, Cantonese, and Mandarin, Christine is adept at working with clients from diverse backgrounds, ensuring clear communication and a seamless experience. Her dedication to providing high-quality legal support and her commitment to client satisfaction have earned her a reputation for reliability and professionalism.<br/><br/>Outside of her professional life, Christine is a devoted mother who spends much of her free time managing and juggling her teenage children’s schooling and thriving volleyball careers. Her ability to balance a demanding work schedule with her family’s busy life reflects her exceptional time-management skills and unwavering dedication to those she cares about.",
      "image": "/assets/team/christine-guan.jpg",
      "education": ["Senior Licensed Paralegal"],
      "phone": [
        { "number": "905-538-5176", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "cguan@luklawpc.com"
    },
    {
      "name": "Rebecca Tsui",
      "position": "Office Manager",
      "description": "Rebecca Tsui is the backbone of our law firm, ensuring seamless operations with her exceptional organizational skills and dedication to excellence. She plays a pivotal role in maintaining efficiency, fostering a positive work environment, and supporting both our team and clients.<br/><br/>Rebecca oversees day-to-day operations, assists with client intake, manages administrative staff, coordinates schedules, and ensures that our office runs smoothly so our team can focus on delivering outstanding legal services. Known for her attention to detail, problem-solving abilities, and commitment to client satisfaction, Rebecca is an integral part of our firm’s success.<br/><br/>Rebecca holds a Bachelor of Social Science in Psychology from Hong Kong Shue Yan University, where she developed a strong foundation in understanding human behavior, interpersonal dynamics, and effective communication. This background has proven invaluable in her role, enabling her to connect with clients and colleagues on a deeper level and manage complex situations with empathy and professionalism.<br/><br/>Before joining the law firm, Rebecca built a diverse professional background in Hong Kong. She worked as a Universal Banker at HSBC, where she honed her skills in customer service and financial management within the banking sector. Additionally, she gained valuable experience working in the Hong Kong Immigration Department, where she developed a deep understanding of immigration processes and the efficient functioning of government operations. These diverse experiences bring a unique perspective and valuable expertise to her role in managing the complexities of a law firm.<br/><br/>Fluent in Mandarin, Cantonese, and English, Rebecca effortlessly communicates with clients and colleagues from diverse cultural backgrounds. Her multilingual abilities and cross-cultural understanding further enhance the firm’s ability to serve its clients effectively.<br/><br/>Rebecca is committed to providing seamless support to both the team and our clients, and her professionalism and dedication make her an indispensable part of the firm.",
      "image": "/assets/team/rebecca-tsui.jpg",
      "education": ["B.Soc.Sc. Hong Kong Shue Yan University"],
      "phone": [
        { "number": "905-667-6499", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "rtsui@luklawpc.com"
    },
    {
      "name": "Camila Su",
      "position": "Legal Assistant & Paralegal Licensing Candidate",
      "description": "Camila Su is a dedicated and resourceful legal professional who currently serves as a Legal Assistant while preparing to write her Paralegal Licensing Exam. A graduate of the University of Waterloo and a recent completer of the Accelerated Paralegal Program at Centennial College, Camila brings a strong academic foundation and a passion for the legal field to her role.<br/><br/>In her current position, Camila plays a crucial role in conducting legal research, managing case files, and coordinating communications between clients, courts, and other parties. She also assists with scheduling, calendaring important deadlines, and ensuring that all case-related tasks are completed with precision and efficiency. Her ability to adapt to changing priorities and solve problems proactively makes her an invaluable asset to our team.<br/><br/>Camila is currently assisting the team and clients with matters related to Provincial Offences, Landlord and Tenant Board claims, and Small Claims Court issues. Her ability to navigate these areas with care and professionalism ensures that clients receive the support and guidance they need to resolve their legal matters effectively.<br/><br/>Natively fluent in English and Cantonese, and professionally fluent in Mandarin, Camila leverages her exceptional communication abilities to support the firm’s litigation efforts. Whether she’s drafting documents, coordinating with clients, or assisting during hearings, her language skills and cultural understanding help bridge gaps and ensure clear, effective communication.<br/><br/>Outside of work, Camila is passionate about traveling and enjoys exploring new cultures and destinations whenever she can. She is also enjoying learning Muay Thai, where she channels her energy and discipline into mastering the basics of this dynamic martial art. Her adventurous spirit and dedication to personal growth reflect her commitment to excellence in both her professional and personal life.<br/><br/>Camila’s professionalism, reliability, and enthusiasm for the legal profession make her an indispensable part of our team. We look forward to supporting her as she takes the next step toward becoming a licensed paralegal and continues to provide exceptional service to our clients.",
      "image": "/assets/team/camila-su.jpg",
      "education": ["B.Sc., University of Waterloo"],
      "phone": [
        { "number": "905-667-6499", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "csu@luklawpc.com"
    },
    {
      "name": "Kathy Liang",
      "position": "Legal Assistant & Paralegal Licensing Candidate",
      "description": "Kathy Liang is a dedicated and driven legal professional who has grown with our law firm, starting as a Legal Intern and now contributing as a valued Legal Assistant. A graduate of Queen’s University with a Bachelor of Arts (Honours), Kathy is currently completing her Accelerated Paralegal Program at Seneca Polytechnic and preparing to write her Paralegal Licensing Exam. She brings a fresh perspective, a strong work ethic, and a passion for the legal field to her role.<br/><br/>Kathy currently assists the team and clients primarily in accident benefits claims and ticketing matters. Her ability to navigate these areas with care and professionalism ensures that clients receive the support and guidance they need to resolve their legal matters effectively.<br/><br/>During her time as a Legal Intern, Kathy demonstrated exceptional research skills, precision, and a commitment to supporting our lawyers and clients. Now, as a Legal Assistant, she plays a key role in organizing case files, managing client communications, and ensuring the smooth operation of our firm. Her enthusiasm for learning and her proactive approach make her an invaluable asset to our team.<br/><br/>Natively fluent in English and Cantonese, and with a solid understanding of Mandarin, Kathy leverages her language skills to communicate effectively with clients and colleagues from diverse backgrounds. Her ability to bridge cultural and linguistic gaps enhances the firm’s ability to provide personalized and effective legal services.<br/><br/>Outside of work, Kathy is a big fan of winter sports, enjoying activities like skiing and snowboarding whenever she can. She also has a knack for scoring concert tickets, often finding herself in the front row at her favorite events. Her adventurous spirit and love for life bring a unique energy to the team.<br/><br/>Kathy’s professionalism, reliability, and enthusiasm for the legal profession make her an indispensable part of our team. We are excited to see her continue to grow and thrive as she embarks on the next chapter of her legal career.",
      "image": "/assets/team/kathy-liang.jpg",
      "education": ["B.Sc., Queen's University"],
      "phone": [
        { "number": "905-667-6496", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "kliang@luklawpc.com"
    },
    {
      "name": "Mandy Zhao",
      "position": "Legal Assistant",
      "description": "Mandy Zhao is a highly organized and detail-oriented legal professional who plays a critical role in supporting our lawyers and ensuring the smooth operation of our legal practice. With her extensive experience in legal research, case management, and court filings, Mandy is a trusted resource for both the team and our clients. Her ability to navigate complex legal procedures and her commitment to accuracy and efficiency make her an essential part of our firm’s success.<br/><br/>Mandy’s responsibilities include preparing and filing court documents, managing case files, and ensuring compliance with court deadlines and procedures. She also conducts legal research, coordinates communications between clients, courts, and other parties, and assists with scheduling and calendaring. Her proactive approach and ability to handle multiple tasks with precision ensure that our lawyers can focus on delivering exceptional legal representation.<br/><br/>Outside of work, Mandy is an adventurous spirit who loves snowboarding during the winter months, embracing the thrill of the slopes. She is also a devoted Taylor Swift fan and enjoys attending concerts whenever she can. Her vibrant personality and passion for life bring a unique energy to the team.<br/><br/>Mandy’s ability to communicate in Mandarin, Cantonese, and English allows her to bridge cultural and linguistic gaps, ensuring that clients feel understood and supported. She also has a foundation in Spanish, which reflects her passion for languages and her ability to connect with people from diverse backgrounds. Whether she’s assisting with legal documents or explaining complex processes, Mandy’s multilingual skills help create a seamless experience for clients.<br/><br/>Mandy’s professionalism, reliability, and enthusiasm for the legal profession make her an indispensable part of our team.",
      "image": "/assets/team/mandy-zhao.jpg",
      "education": ["B.Sc. (Hons.) York University"],
      "phone": [
        { "number": "905-667-6496", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "mzhao@luklawpc.com"
    },
    {
      "name": "Emma-Jane Ni",
      "position": "Legal Assistant",
      "description": "Emma-Jane Ni is a vital member of our team, providing essential support to our lawyers and ensuring the efficient operation of our legal practice. With her strong attention to detail, exceptional organizational skills, and deep understanding of legal processes, Emma-Jane plays a key role in delivering high-quality service to our clients.<br/><br/>Emma-Jane’s responsibilities include conducting legal research, managing case files, coordinating communications between clients, courts, and other parties, and drafting preliminary legal documents. Her ability to assist in preparing early drafts of legal materials ensures that our lawyers can focus on refining and advancing cases efficiently. She also assists with scheduling, calendaring important deadlines, and ensuring that all case-related tasks are completed accurately and on time. Her proactive approach and dedication to excellence make her an invaluable asset to the firm.<br/><br/>Emma-Jane plans to further her legal education by enrolling in the Paralegal Program at Seneca College, which will enhance her legal knowledge and professional skills. This step reflects her commitment to professional growth and her passion for the legal field.<br/><br/>Outside of work, Emma-Jane is an avid gamer who enjoys playing League of Legends, Valorant, and Marvel Rivals, where she thrives on teamwork and strategic challenges. She is also a proud owner of a Persian longhair cat, whose playful and regal personality brings joy to her life.<br/><br/>Fluent in Mandarin, English, French, and conversational Russian, Emma-Jane effortlessly communicates with clients and colleagues from diverse cultural and linguistic backgrounds. Her multilingual abilities and cross-cultural understanding greatly enhance the firm’s ability to serve a global clientele.<br/><br/>Emma-Jane’s dedication, professionalism, and enthusiasm for the legal profession make her an indispensable part of our team.",
      "image": "/assets/team/emma-jane.jpg",
      "education": ["B.A. (Hons.) Toronto Metropolitan University"],
      "phone": [
        { "number": "905-667-6496", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "eni@luklawpc.com"
    },
    {
      "name": "Rachel Chan",
      "position": "Legal Assistant",
      "description": "Rachel Chan is a dedicated and driven legal professional who plays a key role in supporting our lawyers and clients through her exceptional research skills and attention to detail. Currently in the process of completing her undergraduate degree at the University of Waterloo, Rachel brings a strong academic foundation and a passion for the legal field to her role as a Legal Assistant.<br/><br/>Rachel’s primary focus is on conducting in-depth legal research, analyzing case law, and preparing comprehensive reports to assist the team in building strong legal strategies. She also collaborates with Jessica, our Social Media Manager, to research and develop engaging content for the firm’s online platforms. Her ability to synthesize complex information and present it in a clear and concise manner makes her an invaluable asset to the firm.<br/><br/>In addition to her research work, Rachel assists with case management, document preparation, and client communications, ensuring that all tasks are completed accurately and on time. Her enthusiasm for learning and her proactive approach reflect her commitment to excellence in both her academic and professional pursuits.<br/><br/>Outside of work, Rachel is an extremely skilled badminton player, showcasing her agility and competitive spirit on the court. Her dedication to continuous growth and her ability to balance her studies with her professional responsibilities showcase her strong work ethic and determination.<br/><br/>Rachel’s professionalism, reliability, and enthusiasm for the legal profession make her an indispensable part of our team.",
      "image": "/assets/team/rachel-chan.jpg",
      "education": ["B.A. University of Waterloo (In progress)"],
      "phone": [
        { "number": "905-667-6499", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "rchan@luklawpc.com"
    },
    {
      "name": "Venus Ng",
      "position": "Legal Assistant",
      "description": "Venus brings a unique blend of professional experience and a passion for the legal field to her role as a Legal Assistant at our law firm. With a Bachelor of Education from the University of Hong Kong and a background in the banking industry, Venus has honed her skills in organization, client service, and administrative efficiency—qualities that have seamlessly translated into her work supporting our lawyers and clients.<br/><br/>Her educational background has equipped her with exceptional patience and the ability to explain complex concepts in a clear and accessible manner. These skills are invaluable when dealing with clients, as she takes the time to ensure they feel informed and supported throughout their legal journey.<br/><br/>Since joining the firm, Venus has become an integral part of our team, excelling in administrative tasks such as case management, document preparation, and coordinating schedules. She ensures that our operations run smoothly by maintaining organized systems, tracking deadlines, and managing client communications with precision. Her ability to adapt quickly, coupled with her exceptional communication and problem-solving skills, makes her a reliable and resourceful legal assistant.<br/><br/>Fluent in Mandarin, Cantonese, and English, Venus effortlessly communicates with clients and colleagues from diverse cultural and linguistic backgrounds. Her multilingual abilities and cultural sensitivity enhance the firm’s ability to provide personalized and effective legal services.<br/><br/>Outside of work, Venus is an avid fan of winter sports, enjoying activities like skiing and snowboarding whenever she can. Her vibrant personality and passion for life add a unique energy to the team.<br/><br/>Venus’s professionalism, organizational expertise, and dedication to excellence make her an indispensable part of our team.",
      "image": "/assets/team/venus-ng.jpg",
      "education": ["B.Ed. University of Hong Kong"],
      "phone": [
        { "number": "905-667-6496", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "vng@luklawpc.com"
    },
    {
      "name": "Jessica Chen",
      "position": "Social Media Manager",
      "description": "Jessica is the creative force behind our online presence, bringing a wealth of experience and a strategic approach to her role as Social Media Manager. A graduate of the University of Toronto, Canada’s top university, Jessica earned her Bachelor of Science (Honours), which has equipped her with analytical thinking and a meticulous attention to detail—skills that she applies to crafting compelling content and building our brand identity.<br/><br/>With many years of experience managing and creating content for various professions, Jessica is dedicated to enhancing Luk Law’s social media presence. She has a keen understanding of digital trends and a talent for engaging audiences, ensuring that our online platforms reflect the firm’s professionalism and commitment to excellence.<br/><br/>In her spare time, Jessica is a talented artist who creates hand-painted pet portraits, which have gained significant popularity on Instagram. She also runs an extremely popular Instagram page for her pet rabbit, Timbit, showcasing her creativity and love for animals. Her artistic flair and passion for storytelling shine through in both her personal projects and her work for the firm.<br/><br/>Jessica’s innovative approach, combined with her dedication to building meaningful connections online, makes her an invaluable part of our team.",
      "image": "/assets/team/jessica-chen.jpg",
      "education": ["B.Sc. (Hons.) University of Toronto"],
      "phone": [
        { "number": "905-667-6496", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "jchen@luklawpc.com"
    },
    {
      "name": "Angela Tsui",
      "position": "Accounts Manager",
      "description": "Angela Tsui is a highly skilled and detail-oriented professional who plays a vital role in managing the financial operations of our firm as the Accounts Manager. With over 10 years of experience in the banking industry, Angela brings a wealth of knowledge in financial management, budgeting, and client accounts to her role. Her expertise ensures that the firm’s financial systems run smoothly and efficiently.<br/><br/>Angela’s responsibilities include overseeing accounts payable and receivable, preparing financial reports, and managing payroll and billing processes. Her ability to maintain accuracy and organization in all financial matters makes her an indispensable part of our team.<br/><br/>Fluent in English, Cantonese, and Mandarin, Angela effortlessly communicates with clients, colleagues, and vendors from diverse backgrounds. Her multilingual abilities and cultural understanding enhance the firm’s ability to provide seamless financial services.<br/><br/>Outside of work, Angela is a proud mom to her toddler, balancing her professional responsibilities with the joys and challenges of parenthood. Her dedication to her family and her ability to manage multiple priorities reflect her strong work ethic and organizational skills.<br/><br/>Angela’s professionalism, reliability, and commitment to excellence make her an invaluable asset to our team.",
      "image": "/assets/team/angela-tsui.jpg",
      "education": ["B.A. (Hons.) University of Greenwich"],
      "phone": [
        { "number": "905-667-6499", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ]
    },
    {
      "name": "Noora Lai",
      "position": "Legal Intern",
      "description": "Noora Lai is a motivated and detail-oriented Legal Intern currently enrolled in the Paralegal Program at Seneca Polytechnic. With a passion for justice and a growing foundation in legal knowledge, Noora brings enthusiasm, diligence, and a client-focused mindset to her role at our firm.<br/><br/>As part of the legal team, Noora supports lawyers and clients in various areas, contributing to legal research, document preparation, and case organization. Her ability to absorb complex information and apply it practically ensures that she consistently delivers reliable support in fast-paced legal settings.<br/><br/>Noora’s multilingual skills—fluent in Cantonese, Mandarin, and English—enable her to communicate effectively with a diverse clientele and bridge cultural gaps with ease. Her language proficiency enhances client service and helps foster trust and clarity in every interaction.<br/><br/>Dedicated to developing her legal expertise, Noora approaches each task with professionalism and a willingness to learn. Her strong organizational skills, proactive attitude, and genuine interest in helping clients navigate their legal matters make her a valuable member of the team.<br/><br/>Outside of her legal pursuits, Noora enjoys mindfulness activities that promote balance and well-being. Her thoughtful approach to both personal growth and professional development brings a calm and grounded energy to the team.<br/><br/>Noora’s professionalism, reliability, and enthusiasm for the legal profession make her an indispensable part of our team.",
      "image": "/assets/team/noora-lai.jpg",
      "education": ["B.A. Hong Kong Shue Yan University"],
      "phone": [
        { "number": "905-333-1740", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "student@luklawpc.com"
    }
  ],
  "languages": [
    {
      "name": "English",
      "flag": "/assets/language/canada.png"
    },
    {
      "name": "Mandarin & Cantonese",
      "flag": "/assets/language/china.png"
    },
    {
      "name": "Vietnamese",
      "flag": "/assets/language/vietnam.png"
    },
    {
      "name": "Korean",
      "flag": "/assets/language/south-korea.png"
    },
    {
      "name": "Farsi",
      "flag": "/assets/language/iran.png"
    },
    {
      "name": "Ukrainian",
      "flag": "/assets/language/ukraine.png"
    },
    {
      "name": "Russian",
      "flag": "/assets/language/russia.png"
    }
  ]
}
