{
  "title": "Meet Our Team",
  "bannerText": "Our Team",
  "heading": {
    "meet": "Meet",
    "contact": "Contact",
    "education": "Education and Licenses",
    "language": "We speak your language"
  },
  "team": [
    {
      "name": "Raymond Luk",
      "position": "Barrister & Solicitor | Notary Public | Founder",
      "description": "Raymond Luk is the founding lawyer of the firm, known for his dedication, depth of knowledge, and client centered approach to legal practice. A proud graduate of the University of Toronto, Raymond earned an Honours Bachelor of Arts with High Distinction before completing his Juris Doctor at Queen’s University.<br/><br/>Raymond has represented clients before the Superior Court of Ontario, the Licensed Appeal Tribunal, and the Human Rights Tribunal of Ontario. He is a skilled advocate focused on practical strategy and achieving the best possible outcome for each client. His practice spans Family Law, Wills and Estates, Personal Injury, Real Estate, and Corporate Law, allowing him to provide well rounded legal solutions tailored to each client’s unique needs.<br/><br/>Beyond his practice, Raymond regularly contributes legal commentary in the media. He is a frequent contributor to Ming Pao Daily News and has also contributed to Sing Tao Media Group (Canada). He has made multiple appearances on OMNI News, a multilingual local and national newscast on OMNI Television, where he shares insights on legal issues affecting the community. Through these platforms, he strives to make the law more accessible and to help the public better understand their rights.<br/><br/>Raymond is committed to building a practice rooted in integrity, professionalism, and a deep understanding of the law. He takes pride in providing personalized attention and clear, practical advice so clients can navigate complex legal matters with confidence.<br/><br/>He is fluent in English and Cantonese, and has knowledge of Mandarin, allowing him to serve a diverse client base with care and understanding.",
      "image": "/assets/team/raymond-luk.jpg",
      "education": [
        "Bachelor of Arts (Honours), University of Toronto",
        "Juris Doctor, Queen’s University",
        "Barrister and Solicitor, Law Society of Ontario",
        "Notary Public, Province of Ontario"
      ],
      "phone": [
        { "number": "905-333-1740", "description": "Ext.168 (Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "rluk@luklawpc.com"
    },
    {
      "name": "Eiman Sharifpour",
      "position": "Barrister & Solicitor | Notary Public",
      "description": "Eiman Sharifpour is a dedicated and compassionate family law attorney who brings a client-focused approach to every case. With a deep understanding of the emotional and legal complexities surrounding family law matters, Eiman is committed to providing personalized and effective solutions for his clients.<br/><br/>Eiman’s practice encompasses a wide range of family law issues, including divorce, child custody, spousal support, and property division. He is known for his ability to navigate challenging situations with empathy, strategic thinking, and a steadfast commitment to achieving the best possible outcomes for his clients.<br/><br/>A skilled negotiator and litigator, Eiman is equally adept at resolving cases through mediation and collaborative law as he is at advocating for his clients in the courtroom. His attention to detail, strong communication skills, and unwavering dedication have earned him the trust and respect of his clients and peers alike.<br/><br/>Outside of his legal practice, Eiman is a passionate sports enthusiast. He is an avid supporter of the Toronto Raptors and FC Barcelona, and he enjoys playing soccer in his free time. His love for teamwork and competition on the field translates into his approach to the law, where he strives to collaborate effectively and advocate fiercely for his clients.<br/><br/>Eiman earned his Juris Doctor from the University of Windsor and is a member of the Law Society of Ontario. Eiman works closely with Raymond and the rest of the team to ensure that every client receives the highest level of legal representation and support during some of life’s most difficult moments.",
      "image": "/assets/team/eiman-sharifpour.jpg",
      "education": [
        "Bachelor of Science, York University",
        "Juris Doctor, University of Windsor",
        "Barrister and Solicitor, Law Society of Ontario",
        "Notary Public, Province of Ontario"
      ],
      "phone": [
        { "number": "905-291-1802", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "esharifpour@luklawpc.com",
      "desc": "* Currently practicing through Iman Law Professional Corporation"
    },
    {
      "name": "Christine Guan",
      "position": "Senior Law Clerk",
      "description": "Christine Guan is a highly skilled and detail-oriented Real Estate Law Clerk and Licensed Paralegal with over 10 years of experience in the legal field. Originally specializing in tort and accident benefits law as a paralegal, Christine has since transitioned into real estate law, where she brings her exceptional organizational skills, legal knowledge, and client-focused approach to every transaction.<br/><br/>Christine’s expertise covers a wide range of real estate services, including residential and commercial transactions, title searches, drafting legal documents, and coordinating closings. Her meticulous attention to detail, proactive mindset, and ability to manage complex processes make her an invaluable asset to clients and the legal team alike.<br/><br/>Fluent in English, Cantonese, and Mandarin, Christine is adept at working with clients from diverse backgrounds, ensuring clear communication and a seamless experience. Her dedication to providing high-quality legal support and her commitment to client satisfaction have earned her a reputation for reliability and professionalism.<br/><br/>Outside of her professional life, Christine is a devoted mother who spends much of her free time managing and juggling her teenage children’s schooling and thriving volleyball careers. Her ability to balance a demanding work schedule with her family’s busy life reflects her exceptional time-management skills and unwavering dedication to those she cares about.",
      "image": "/assets/team/christine-guan.jpg",
      "education": ["Bachelor of Business Administration, Seneca Polytechnic", "Paralegal Program, Algonquin Career Academy", "Licensed Paralegal, Law Society of Ontario (non-practising)"],
      "phone": [
        { "number": "905-538-5176", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "cguan@luklawpc.com"
    },
    {
      "name": "Raymond Lee",
      "position": "Senior Licensed Paralegal",
      "description": "Raymond Lee is a skilled and dedicated paralegal who brings precision and professionalism to his practice. Licensed by the Law Society of Ontario, Raymond acts primarily in Landlord and Tenant Board disputes, Small Claims Court matters, and provincial offence/ticketing files, providing clients with clear guidance and assertive representation.<br/><br/>Raymond holds a Bachelor of Commerce from the University of Toronto, an Advanced Diploma in Legal Studies (Common Law) from the University of Hong Kong, and is a Fellow of the Institute of Paralegals in the United Kingdom. This diverse academic background equips him with both legal and business insight, enhancing his ability to address complex legal matters with analytical depth and practical judgment.<br/><br/>With a thorough understanding of procedural law and a client-focused approach, Raymond assists tenants, landlords, and individuals navigating legal challenges—from lease disputes and eviction proceedings to debt recovery and traffic violations. His ability to simplify complex processes empowers clients to make informed decisions about their cases.<br/><br/>Fluent in English, Cantonese, and Mandarin, Raymond ensures effective communication with clients from diverse backgrounds, fostering trust and clarity throughout the legal process. His cultural competency and attention to detail enable him to deliver tailored solutions for each client’s unique needs.<br/><br/>Committed to accessibility and efficiency, Raymond combines rigorous legal analysis with practical strategies to achieve resolutions. Whether negotiating settlements or advocating in courts and tribunals, he prioritizes his clients’ best interests with integrity and professionalism.<br/><br/>Outside the office, Raymond enjoys swimming, cycling, and cheering on Liverpool FC. He also loves traveling with his family, exploring new destinations whenever possible.",
      "image": "/assets/team/raymond-lee.jpg",
      "education": [
        "Bachelor of Commerce, University of Toronto",
        "Advanced Diploma in Legal Studies, HKU SPACE (The University of Hong Kong) ",
        "Licensed Paralegal, Law Society of Ontario",
        "Fellow, Institute of Paralegals (United Kingdom)"
      ],
      "phone": [
        { "number": "905-333-1740", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "rlee@luklawpc.com"
    },
    {
      "name": "Rebecca Tsui",
      "position": "Office Manager",
      "description": "Rebecca Tsui is the backbone of our law firm, ensuring seamless operations with her exceptional organizational skills and dedication to excellence. She plays a pivotal role in maintaining efficiency, fostering a positive work environment, and supporting both our team and clients.<br/><br/>Rebecca oversees day-to-day operations, assists with client intake, manages administrative staff, coordinates schedules, and ensures that our office runs smoothly so our team can focus on delivering outstanding legal services. Known for her attention to detail, problem-solving abilities, and commitment to client satisfaction, Rebecca is an integral part of our firm’s success.<br/><br/>Rebecca holds a Bachelor of Social Science in Psychology from Hong Kong Shue Yan University, where she developed a strong foundation in understanding human behavior, interpersonal dynamics, and effective communication. This background has proven invaluable in her role, enabling her to connect with clients and colleagues on a deeper level and manage complex situations with empathy and professionalism.<br/><br/>Before joining the law firm, Rebecca built a diverse professional background in Hong Kong. She worked as a Universal Banker at HSBC, where she honed her skills in customer service and financial management within the banking sector. Additionally, she gained valuable experience working in the Hong Kong Immigration Department, where she developed a deep understanding of immigration processes and the efficient functioning of government operations. These diverse experiences bring a unique perspective and valuable expertise to her role in managing the complexities of a law firm.<br/><br/>Fluent in Mandarin, Cantonese, and English, Rebecca effortlessly communicates with clients and colleagues from diverse cultural backgrounds. Her multilingual abilities and cross-cultural understanding further enhance the firm’s ability to serve its clients effectively.<br/><br/>Rebecca is committed to providing seamless support to both the team and our clients, and her professionalism and dedication make her an indispensable part of the firm.",
      "image": "/assets/team/rebecca-tsui.jpg",
      "education": ["Bachelor of Social Sciences, Hong Kong Shue Yan University"],
      "phone": [
        { "number": "905-667-6499", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "rtsui@luklawpc.com"
    },
    {
      "name": "Camila Su",
      "position": "Licensed Paralegal",
      "description": "Camila Su is a Licensed Paralegal who represents clients in Provincial Offences matters, Landlord and Tenant Board proceedings, and Small Claims Court disputes. She is known for strong preparation, practical problem solving, and clear communication that helps clients understand their options and move forward with confidence.<br/><br/>Camila’s career with the firm reflects our commitment to long term growth and mentorship. She began with us as a legal intern, stayed on as a legal assistant, and has since advanced into her current role as a Licensed Paralegal. A graduate of the University of Waterloo and Centennial College’s Accelerated Paralegal Program, she combines a strong academic foundation with hands on experience supporting clients through tribunal and court processes.<br/><br/>Camila assists clients through each stage of their matter, from early strategy and document preparation to negotiation and attendance at hearings where appropriate. Clients appreciate her professionalism, responsiveness, and steady approach, especially when deadlines and high stakes decisions are involved.<br/><br/>Natively fluent in English and Cantonese, and professionally fluent in Mandarin, Camila’s multilingual communication and cultural awareness help ensure instructions, documents, and expectations are clearly understood.<br/><br/>In addition to her work as a paralegal, Camila also supports the team as a Lead Case Manager, helping keep files organized and moving through proactive follow up, deadline management, and consistent client updates.<br/><br/>Outside of work, Camila enjoys traveling and exploring new cultures and destinations. She is also learning Muay Thai, which reflects her energy, discipline, and commitment to continuous improvement. Those same qualities show up in her practice through strong preparation, steady follow through, and clear communication.",
      "image": "/assets/team/camila-su.jpg",
      "education": [
        "Bachelor of Science (Honours), University of Waterloo",
        "Ontario College Graduate Certificate, Paralegal Program, Centennial College",
        "Licensed Paralegal, Law Society of Ontario"
      ],
      "phone": [
        { "number": "905-667-6499", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "csu@luklawpc.com"
    },
    {
      "name": "Kathy Liang",
      "position": "Legal Assistant & Paralegal Licensing Candidate",
      "description": "Kathy Liang is a dedicated and driven legal professional who has grown with our law firm, starting as a Legal Intern and now contributing as a valued Legal Assistant. A graduate of Queen’s University with a Bachelor of Arts (Honours), Kathy is currently completing her Accelerated Paralegal Program at Seneca Polytechnic and preparing to write her Paralegal Licensing Exam. She brings a fresh perspective, a strong work ethic, and a passion for the legal field to her role.<br/><br/>Kathy currently assists the team and clients primarily in accident benefits claims and ticketing matters. Her ability to navigate these areas with care and professionalism ensures that clients receive the support and guidance they need to resolve their legal matters effectively.<br/><br/>During her time as a Legal Intern, Kathy demonstrated exceptional research skills, precision, and a commitment to supporting our lawyers and clients. Now, as a Legal Assistant, she plays a key role in organizing case files, managing client communications, and ensuring the smooth operation of our firm. Her enthusiasm for learning and her proactive approach make her an invaluable asset to our team.<br/><br/>Natively fluent in English and Cantonese, and with a solid understanding of Mandarin, Kathy leverages her language skills to communicate effectively with clients and colleagues from diverse backgrounds. Her ability to bridge cultural and linguistic gaps enhances the firm’s ability to provide personalized and effective legal services.<br/><br/>Outside of work, Kathy is a big fan of winter sports, enjoying activities like skiing and snowboarding whenever she can. She also has a knack for scoring concert tickets, often finding herself in the front row at her favorite events. Her adventurous spirit and love for life bring a unique energy to the team.<br/><br/>Kathy’s professionalism, reliability, and enthusiasm for the legal profession make her an indispensable part of our team. We are excited to see her continue to grow and thrive as she embarks on the next chapter of her legal career.",
      "image": "/assets/team/kathy-liang.jpg",
      "education": ["Bachelor of Science (Honours), Queen’s University", "Ontario College Diploma, Paralegal, Seneca Polytechnic"],
      "phone": [
        { "number": "905-667-6496", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "kliang@luklawpc.com"
    },
    {
      "name": "Noora Lai",
      "position": "Legal Assistant & Paralegal Licensing Candidate",
      "description": "Noora Lai is a dedicated and detail-oriented Legal Assistant at our firm. Currently completing the Paralegal Program at Seneca Polytechnic, she brings strong academic training, organizational skills, and a client-focused mindset to her role.<br/><br/>In her position, Noora supports our lawyers across a wide range of matters, assisting with legal research, document drafting, case preparation, and day-to-day client communication. Her ability to quickly absorb complex information and apply it in practice ensures that she provides reliable and efficient support in fast-paced legal environments.<br/><br/>Fluent in Cantonese, Mandarin, and English, Noora is able to serve a diverse clientele and help bridge cultural and language barriers with ease. Her multilingual skills enhance client service and foster trust and understanding in every interaction.<br/><br/>Outside of her professional responsibilities, Noora values mindfulness and activities that promote balance and well-being. She enjoys exploring new cuisines, spending time with friends and family, and finding creative outlets that keep her energized. Her calm and approachable nature not only makes her a supportive teammate, but also helps clients feel comfortable and cared for throughout their legal journey.",
      "image": "/assets/team/noora-lai.jpg",
      "education": ["Bachelor of Arts, Hong Kong Shue Yan University"],
      "phone": [
        { "number": "905-333-1740", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "nlai@luklawpc.com"
    },
    {
      "name": "Rachel Chan",
      "position": "Legal Assistant",
      "description": "Rachel Chan is a dedicated and driven legal professional who plays a key role in supporting our lawyers and clients through her exceptional research skills and attention to detail. Currently in the process of completing her undergraduate degree at the University of Waterloo, Rachel brings a strong academic foundation and a passion for the legal field to her role as a Legal Assistant.<br/><br/>Rachel’s primary focus is on conducting in-depth legal research, analyzing case law, and preparing comprehensive reports to assist the team in building strong legal strategies. She also collaborates with Jessica, our Social Media Manager, to research and develop engaging content for the firm’s online platforms. Her ability to synthesize complex information and present it in a clear and concise manner makes her an invaluable asset to the firm.<br/><br/>In addition to her research work, Rachel assists with case management, document preparation, and client communications, ensuring that all tasks are completed accurately and on time. Her enthusiasm for learning and her proactive approach reflect her commitment to excellence in both her academic and professional pursuits.<br/><br/>Outside of work, Rachel is an extremely skilled badminton player, showcasing her agility and competitive spirit on the court. Her dedication to continuous growth and her ability to balance her studies with her professional responsibilities showcase her strong work ethic and determination.<br/><br/>Rachel’s professionalism, reliability, and enthusiasm for the legal profession make her an indispensable part of our team.",
      "image": "/assets/team/rachel-chan.jpg",
      "education": ["Bachelor of Arts, University of Waterloo (in progress)"],
      "phone": [
        { "number": "905-667-6499", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "rchan@luklawpc.com"
    },
    {
      "name": "Venus Ng",
      "position": "Law Clerk",
      "description": "Venus Ng is a Law Clerk who brings a strong client service background and a steady, organized approach to supporting both lawyers and clients. She holds a Bachelor of Education (Honours) from The Education University of Hong Kong and previously worked in the banking industry, where she developed a high standard of professionalism, attention to detail, and process driven execution. Venus is known for being responsive, thorough, and proactive about keeping clients informed on next steps.<br/><br/>Venus primarily supports files in real estate, immigration, and wills and estates. She assists with document preparation, intake and information gathering, coordinating key milestones, and ensuring files move forward smoothly and on time. Clients appreciate her patience and clear communication, especially in matters with multiple steps and strict timelines.<br/><br/>Fluent in Mandarin, Cantonese, and English, Venus works comfortably with clients from diverse cultural and linguistic backgrounds. Her multilingual communication and cultural sensitivity strengthen the firm’s ability to provide clear guidance and a personalized client experience.<br/><br/>Outside of work, Venus enjoys winter sports, including skiing and snowboarding. Whether she’s on the slopes or in the office, she is steady, prepared, and committed to doing things properly.",
      "image": "/assets/team/venus-ng.jpg",
      "education": ["Bachelor of Education (Honours), The Education University of Hong Kong"],
      "phone": [
        { "number": "905-667-6496", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "vng@luklawpc.com"
    },
    {
      "name": "Yan Wong",
      "position": "Receptionist",
      "description": "Yan is the first point of contact at the law firm, ensuring that every client who calls or visits our office is welcomed with professionalism and care. She holds a Bachelor of Arts in Hospitality and Attractions Management from the Open University of Hong Kong (now Hong Kong Metropolitan University), where she developed a strong foundation in client service, organizational management, and cultural communication.<br/><br/>Her background in international hospitality allows her to bring a unique perspective to client interactions, combining warmth and attentiveness with the ability to manage multiple priorities in a fast-paced environment. She plays a vital role in coordinating client communications, maintaining office efficiency, and supporting the legal team so that clients receive the highest level of service from start to finish.<br/><br/>Outside of the office, Yan has always been drawn to active pursuits. A former school basketball player, she continues to channel that same team spirit and discipline into her work and personal life. These days, she balances her love for sports with exploring new restaurants around the city and nurturing a growing interest in badminton. Her energy, passion, and ability to connect with others make her not only a valued colleague but also someone clients feel immediately at ease with.",
      "image": "/assets/team/yan-wong.jpg",
      "education": ["Bachelor of Arts, Hong Kong Metropolitan University"],
      "phone": [
        { "number": "905-667-6496", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ]
    },
    {
      "name": "Jessica Chen",
      "position": "Social Media Manager",
      "description": "Jessica is the creative force behind our online presence, bringing a wealth of experience and a strategic approach to her role as Social Media Manager. A graduate of the University of Toronto, Canada’s top university, Jessica earned her Bachelor of Science (Honours), which has equipped her with analytical thinking and a meticulous attention to detail—skills that she applies to crafting compelling content and building our brand identity.<br/><br/>With many years of experience managing and creating content for various professions, Jessica is dedicated to enhancing Luk Law’s social media presence. She has a keen understanding of digital trends and a talent for engaging audiences, ensuring that our online platforms reflect the firm’s professionalism and commitment to excellence.<br/><br/>In her spare time, Jessica is a talented artist who creates hand-painted pet portraits, which have gained significant popularity on Instagram. She also runs an extremely popular Instagram page for her pet rabbit, Timbit, showcasing her creativity and love for animals. Her artistic flair and passion for storytelling shine through in both her personal projects and her work for the firm.<br/><br/>Jessica’s innovative approach, combined with her dedication to building meaningful connections online, makes her an invaluable part of our team.",
      "image": "/assets/team/jessica-chen.jpg",
      "education": ["Bachelor of Science (Honours), University of Toronto"],
      "phone": [
        { "number": "905-667-6496", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ],
      "email": "jchen@luklawpc.com"
    },
    {
      "name": "Angela Tsui",
      "position": "Accounts Manager",
      "description": "Angela Tsui is a highly skilled and detail-oriented professional who plays a vital role in managing the financial operations of our firm as the Accounts Manager. With over 10 years of experience in the banking industry, Angela brings a wealth of knowledge in financial management, budgeting, and client accounts to her role. Her expertise ensures that the firm’s financial systems run smoothly and efficiently.<br/><br/>Angela’s responsibilities include overseeing accounts payable and receivable, preparing financial reports, and managing payroll and billing processes. Her ability to maintain accuracy and organization in all financial matters makes her an indispensable part of our team.<br/><br/>Fluent in English, Cantonese, and Mandarin, Angela effortlessly communicates with clients, colleagues, and vendors from diverse backgrounds. Her multilingual abilities and cultural understanding enhance the firm’s ability to provide seamless financial services.<br/><br/>Outside of work, Angela is a proud mom to her toddler, balancing her professional responsibilities with the joys and challenges of parenthood. Her dedication to her family and her ability to manage multiple priorities reflect her strong work ethic and organizational skills.<br/><br/>Angela’s professionalism, reliability, and commitment to excellence make her an invaluable asset to our team.",
      "image": "/assets/team/angela-tsui.jpg",
      "education": ["B.A. (Hons.) University of Greenwich"],
      "phone": [
        { "number": "905-667-6499", "description": "(Office)" },
        { "number": "905-849-3583", "description": "(Fax)" }
      ]
    }
  ],
  "languages": [
    {
      "name": "English",
      "flag": "/assets/language/canada.png"
    },
    {
      "name": "Mandarin & Cantonese",
      "flag": "/assets/language/china.png"
    },
    {
      "name": "Vietnamese",
      "flag": "/assets/language/vietnam.png"
    },
    {
      "name": "Korean",
      "flag": "/assets/language/south-korea.png"
    },
    {
      "name": "Farsi",
      "flag": "/assets/language/iran.png"
    },
    {
      "name": "Ukrainian",
      "flag": "/assets/language/ukraine.png"
    },
    {
      "name": "Russian",
      "flag": "/assets/language/russia.png"
    }
  ]
}
